docs: network related review pass
